name: "resnet50"
platform: "onnxruntime_onnx"
max_batch_size: 32
input [
  { name: "input" data_type: TYPE_FP32 dims: [3, 224, 224] }
]
output [
  { name: "probabilities" data_type: TYPE_FP32 dims: [1000] }
]
instance_group [{ kind: KIND_GPU }]
dynamic_batching {
  preferred_batch_size: [ 4, 8, 16, 32 ]
  max_queue_delay_microseconds: 2000
}

# Optional response cache (if enabled at server)
# response_cache { enable: true }
