name: "py_postproc"
backend: "python"
max_batch_size: 32
input [
  { name: "probabilities" data_type: TYPE_FP32 dims: [1000] },
  { name: "topk" data_type: TYPE_INT32 dims: [1] }
]
output [
  { name: "indices" data_type: TYPE_INT32 dims: [ -1 ] },
  { name: "scores" data_type: TYPE_FP32 dims: [ -1 ] }
]
instance_group [{ kind: KIND_GPU }]
